sergev/qemu/hw/mips/mips_pic32mx7.c
static void update_irq_status(pic32_t *s)
{
    /* Assume no interrupts pending. */
    int cause_ripl = 0;
    int vector = 0;
    CPUMIPSState *env = &s->cpu->env;
    int current_ripl = (env->CP0_Cause >> (CP0Ca_IP + 2)) & 0x3f;

    VALUE(INTSTAT) = 0;

    if ((VALUE(IFS0) & VALUE(IEC0)) ||
        (VALUE(IFS1) & VALUE(IEC1)) ||
        (VALUE(IFS2) & VALUE(IEC2)))
    {
        /* Find the most prioritive pending interrupt,
         * it's vector and level. */
        int irq;
        for (irq = 0; irq < sizeof(irq_to_vector)/sizeof(int); irq++) {
            int n = irq >> 5;

            if (((VALUE(IFS(n)) & VALUE(IEC(n))) >> (irq & 31)) & 1) {
                /* Interrupt is pending. */
                int v = irq_to_vector[irq];
                if (v < 0) {
                    continue;
                }

                int level = VALUE(IPC(v >> 2));
                level >>= 2 + (v & 3) * 8;
                level &= 7;
                if (level > cause_ripl) {
                    vector = v;
                    cause_ripl = level;
                }
            }
        }
        VALUE(INTSTAT) = vector | (cause_ripl << 8);
    }

    if (cause_ripl == current_ripl) {
        return;
    }

    if (TRACE) {
        fprintf(qemu_logfile, "--- Priority level Cause.RIPL = %u\n",
            cause_ripl);
    }

    /*
     * Modify Cause.RIPL field and take EIC interrupt.
     */
    env->CP0_Cause &= ~(0x3f << (CP0Ca_IP + 2));
    env->CP0_Cause |= cause_ripl << (CP0Ca_IP + 2);
    cpu_interrupt(CPU(s->cpu), CPU_INTERRUPT_HARD);
}

/*
 * Set interrupt flag status
 */
static void irq_raise(pic32_t *s, int irq)
{
    if (VALUE(IFS(irq >> 5)) & (1 << (irq & 31))) {
        return;
    }

    VALUE(IFS(irq >> 5)) |= 1 << (irq & 31);
    update_irq_status(s);
}

/*
 * Clear interrupt flag status
 */
static void irq_clear(pic32_t *s, int irq)
{
    if (!(VALUE(IFS(irq >> 5)) & (1 << (irq & 31)))) {
        return;
    }

    VALUE(IFS(irq >> 5)) &= ~(1 << (irq & 31));
    update_irq_status(s);
}

/*
 * Timer interrupt or soft interrupt.
 */
static void pic32_irq_request(void *opaque, int num, int raise)
{
    pic32_t *s = opaque;
    CPUMIPSState *env = &s->cpu->env;

    if (raise) {
        if (TRACE) {
            if (num == 0)
                fprintf(qemu_logfile, "--- %08x: Timer interrupt\n",
                    env->active_tc.PC);
            else
                fprintf(qemu_logfile, "--- %08x: Soft interrupt %u\n",
                    env->active_tc.PC, num-1);
        }
        irq_raise(s, num);
    } else {
        if (TRACE) {
            if (num == 0)
                fprintf(qemu_logfile, "--- %08x: Clear timer interrupt\n",
                    env->active_tc.PC);
            else
                fprintf(qemu_logfile, "--- %08x: Clear soft interrupt %u\n",
                    env->active_tc.PC, num-1);
        }
        irq_clear(s, num);
    }
}

/*
 * Perform an assign/clear/set/invert operation.
 */
static inline unsigned write_op(int a, int b, int op)
{
    switch (op & 0xc) {
    case 0x0:                   /* Assign */
        a = b;
        break;
    case 0x4:                   /* Clear */
        a &= ~b;
        break;
    case 0x8:                   /* Set */
        a |= b;
        break;
    case 0xc:                   /* Invert */
        a ^= b;
        break;
    }
    return a;
}

static void io_reset(pic32_t *s)
{
    int i;

    /*
     * Bus matrix control registers.
     */
    VALUE(BMXCON)    = 0x001f0041;  /* Bus Matrix Control */
    VALUE(BMXDKPBA)  = 0;           /* Data RAM kernel program base */
    VALUE(BMXDUDBA)  = 0;           /* Data RAM user data base address */
    VALUE(BMXDUPBA)  = 0;           /* Data RAM user program base */
    VALUE(BMXPUPBA)  = 0;           /* Program Flash user program base */
    VALUE(BMXDRMSZ)  = 128 * 1024;  /* Data RAM memory size */
    VALUE(BMXPFMSZ)  = 512 * 1024;  /* Program Flash memory size */
    VALUE(BMXBOOTSZ) = 12 * 1024;   /* Boot Flash size */

    /*
     * Prefetch controller.
     */
    VALUE(CHECON) = 0x00000007;

    /*
     * System controller.
     */
    VALUE(OSCTUN) = 0;
    VALUE(DDPCON) = 0;
    VALUE(SYSKEY) = 0;
    VALUE(RCON)   = 0;
    VALUE(RSWRST) = 0;
    s->syskey_unlock = 0;

    /*
     * Analog to digital converter.
     */
    VALUE(AD1CON1) = 0;             /* Control register 1 */
    VALUE(AD1CON2) = 0;             /* Control register 2 */
    VALUE(AD1CON3) = 0;             /* Control register 3 */
    VALUE(AD1CHS)  = 0;             /* Channel select */
    VALUE(AD1CSSL) = 0;             /* Input scan selection */
    VALUE(AD1PCFG) = 0;             /* Port configuration */

    /*
     * General purpose IO signals.
     * All pins are inputs, high, open drains and pullups disabled.
     * No interrupts on change.
     */
    VALUE(TRISA) = 0xFFFF;          /* Port A: mask of inputs */
    VALUE(PORTA) = 0xFFFF;          /* Port A: read inputs, write outputs */
    VALUE(LATA)  = 0xFFFF;          /* Port A: read/write outputs */
    VALUE(ODCA)  = 0;               /* Port A: open drain configuration */
    VALUE(TRISB) = 0xFFFF;          /* Port B: mask of inputs */
    VALUE(PORTB) = 0xFFFF;          /* Port B: read inputs, write outputs */
    VALUE(LATB)  = 0xFFFF;          /* Port B: read/write outputs */
    VALUE(ODCB)  = 0;               /* Port B: open drain configuration */
    VALUE(TRISC) = 0xFFFF;          /* Port C: mask of inputs */
    VALUE(PORTC) = 0xFFFF;          /* Port C: read inputs, write outputs */
    VALUE(LATC)  = 0xFFFF;          /* Port C: read/write outputs */
    VALUE(ODCC)  = 0;               /* Port C: open drain configuration */
    VALUE(TRISD) = 0xFFFF;          /* Port D: mask of inputs */
    VALUE(PORTD) = 0xFFFF;          /* Port D: read inputs, write outputs */
    VALUE(LATD)  = 0xFFFF;          /* Port D: read/write outputs */
    VALUE(ODCD)  = 0;               /* Port D: open drain configuration */
    VALUE(TRISE) = 0xFFFF;          /* Port E: mask of inputs */
    VALUE(PORTE) = 0xFFFF;          /* Port D: read inputs, write outputs */
    VALUE(LATE)  = 0xFFFF;          /* Port E: read/write outputs */
    VALUE(ODCE)  = 0;               /* Port E: open drain configuration */
    VALUE(TRISF) = 0xFFFF;          /* Port F: mask of inputs */
    VALUE(PORTF) = 0xFFFF;          /* Port F: read inputs, write outputs */
    VALUE(LATF)  = 0xFFFF;          /* Port F: read/write outputs */
    VALUE(ODCF)  = 0;               /* Port F: open drain configuration */
    VALUE(TRISG) = 0xFFFF;          /* Port G: mask of inputs */
    VALUE(PORTG) = 0xFFFF;          /* Port G: read inputs, write outputs */
    VALUE(LATG)  = 0xFFFF;          /* Port G: read/write outputs */
    VALUE(ODCG)  = 0;               /* Port G: open drain configuration */
    VALUE(CNCON) = 0;               /* Interrupt-on-change control */
    VALUE(CNEN)  = 0;               /* Input change interrupt enable */
    VALUE(CNPUE) = 0;               /* Input pin pull-up enable */

