sergev/qemu/hw/mips/mips_pic32mx7.c
    /*
     * Reset UARTs.
     */
    VALUE(U1MODE)  = 0;
    VALUE(U1STA)   = PIC32_USTA_RIDLE | PIC32_USTA_TRMT;
    VALUE(U1TXREG) = 0;
    VALUE(U1RXREG) = 0;
    VALUE(U1BRG)   = 0;
    VALUE(U2MODE)  = 0;
    VALUE(U2STA)   = PIC32_USTA_RIDLE | PIC32_USTA_TRMT;
    VALUE(U2TXREG) = 0;
    VALUE(U2RXREG) = 0;
    VALUE(U2BRG)   = 0;
    VALUE(U3MODE)  = 0;
    VALUE(U3STA)   = PIC32_USTA_RIDLE | PIC32_USTA_TRMT;
    VALUE(U3TXREG) = 0;
    VALUE(U3RXREG) = 0;
    VALUE(U3BRG)   = 0;
    VALUE(U4MODE)  = 0;
    VALUE(U4STA)   = PIC32_USTA_RIDLE | PIC32_USTA_TRMT;
    VALUE(U4TXREG) = 0;
    VALUE(U4RXREG) = 0;
    VALUE(U4BRG)   = 0;
    VALUE(U5MODE)  = 0;
    VALUE(U5STA)   = PIC32_USTA_RIDLE | PIC32_USTA_TRMT;
    VALUE(U5TXREG) = 0;
    VALUE(U5RXREG) = 0;
    VALUE(U5BRG)   = 0;
    VALUE(U6MODE)  = 0;
    VALUE(U6STA)   = PIC32_USTA_RIDLE | PIC32_USTA_TRMT;
    VALUE(U6TXREG) = 0;
    VALUE(U6RXREG) = 0;
    VALUE(U6BRG)   = 0;

    /*
     * Reset SPI.
     */
    VALUE(SPI1CON)  = 0;
    VALUE(SPI1STAT) = PIC32_SPISTAT_SPITBE;     /* Transmit buffer is empty */
    VALUE(SPI1BRG)  = 0;

    VALUE(SPI2CON)  = 0;
    VALUE(SPI2STAT) = PIC32_SPISTAT_SPITBE;     /* Transmit buffer is empty */
    VALUE(SPI2BRG)  = 0;

    VALUE(SPI3CON)  = 0;
    VALUE(SPI3STAT) = PIC32_SPISTAT_SPITBE;     /* Transmit buffer is empty */
    VALUE(SPI3BRG)  = 0;

    VALUE(SPI4CON)  = 0;
    VALUE(SPI4STAT) = PIC32_SPISTAT_SPITBE;     /* Transmit buffer is empty */
    VALUE(SPI4BRG)  = 0;

    for (i = 0; i < NUM_SPI; i++) {
        s->spi[i].rfifo = 0;
        s->spi[i].wfifo = 0;
    }
}

static unsigned io_read32(pic32_t *s, unsigned offset, const char **namep)
{
    unsigned *bufp = &VALUE(offset);

    switch (offset) {
    /*-------------------------------------------------------------------------
     * Bus matrix control registers.
     */
    STORAGE(BMXCON); break;     /* Bus Mmatrix Control */
    STORAGE(BMXDKPBA); break;   /* Data RAM kernel program base address */
    STORAGE(BMXDUDBA); break;   /* Data RAM user data base address */
    STORAGE(BMXDUPBA); break;   /* Data RAM user program base address */
    STORAGE(BMXPUPBA); break;   /* Program Flash user program base address */
    STORAGE(BMXDRMSZ); break;   /* Data RAM memory size */
    STORAGE(BMXPFMSZ); break;   /* Program Flash memory size */
    STORAGE(BMXBOOTSZ); break;  /* Boot Flash size */

    /*-------------------------------------------------------------------------
     * Interrupt controller registers.
     */
    STORAGE(INTCON); break;     /* Interrupt Control */
    STORAGE(INTSTAT); break;    /* Interrupt Status */
    STORAGE(IFS0); break;       /* IFS(0..2) - Interrupt Flag Status */
    STORAGE(IFS1); break;
    STORAGE(IFS2); break;
    STORAGE(IEC0); break;       /* IEC(0..2) - Interrupt Enable Control */
    STORAGE(IEC1); break;
    STORAGE(IEC2); break;
    STORAGE(IPC0); break;       /* IPC(0..11) - Interrupt Priority Control */
    STORAGE(IPC1); break;
    STORAGE(IPC2); break;
    STORAGE(IPC3); break;
    STORAGE(IPC4); break;
    STORAGE(IPC5); break;
    STORAGE(IPC6); break;
    STORAGE(IPC7); break;
    STORAGE(IPC8); break;
    STORAGE(IPC9); break;
    STORAGE(IPC10); break;
    STORAGE(IPC11); break;
    STORAGE(IPC12); break;

    /*-------------------------------------------------------------------------
     * Prefetch controller.
     */
    STORAGE(CHECON); break;     /* Prefetch Control */

    /*-------------------------------------------------------------------------
     * System controller.
     */
    STORAGE(OSCCON); break;     /* Oscillator Control */
    STORAGE(OSCTUN); break;     /* Oscillator Tuning */
    STORAGE(DDPCON); break;     /* Debug Data Port Control */
    STORAGE(DEVID); break;      /* Device Identifier */
    STORAGE(SYSKEY); break;     /* System Key */
    STORAGE(RCON); break;       /* Reset Control */
    STORAGE(RSWRST);            /* Software Reset */
        if ((VALUE(RSWRST) & 1) && s->stop_on_reset) {
            exit(0);
        }
        break;

    /*-------------------------------------------------------------------------
     * DMA controller.
     */
    STORAGE(DMACON); break;     /* DMA Control */
    STORAGE(DMASTAT); break;    /* DMA Status */
    STORAGE(DMAADDR); break;    /* DMA Address */

    /*-------------------------------------------------------------------------
     * Analog to digital converter.
     */
    STORAGE(AD1CON1); break;    /* Control register 1 */
    STORAGE(AD1CON2); break;    /* Control register 2 */
    STORAGE(AD1CON3); break;    /* Control register 3 */
    STORAGE(AD1CHS); break;     /* Channel select */
    STORAGE(AD1CSSL); break;    /* Input scan selection */
    STORAGE(AD1PCFG); break;    /* Port configuration */
    STORAGE(ADC1BUF0); break;   /* Result words */
    STORAGE(ADC1BUF1); break;
    STORAGE(ADC1BUF2); break;
    STORAGE(ADC1BUF3); break;
    STORAGE(ADC1BUF4); break;
    STORAGE(ADC1BUF5); break;
    STORAGE(ADC1BUF6); break;
    STORAGE(ADC1BUF7); break;
    STORAGE(ADC1BUF8); break;
    STORAGE(ADC1BUF9); break;
    STORAGE(ADC1BUFA); break;
    STORAGE(ADC1BUFB); break;
    STORAGE(ADC1BUFC); break;
    STORAGE(ADC1BUFD); break;
    STORAGE(ADC1BUFE); break;
    STORAGE(ADC1BUFF); break;

    /*--------------------------------------
     * USB registers.
     */
    STORAGE(U1OTGIR); break;    /* OTG interrupt flags */
    STORAGE(U1OTGIE); break;    /* OTG interrupt enable */
    STORAGE(U1OTGSTAT); break;  /* Comparator and pin status */
    STORAGE(U1OTGCON); break;   /* Resistor and pin control */
    STORAGE(U1PWRC); break;     /* Power control */
    STORAGE(U1IR); break;       /* Pending interrupt */
    STORAGE(U1IE); break;       /* Interrupt enable */
    STORAGE(U1EIR); break;      /* Pending error interrupt */
    STORAGE(U1EIE); break;      /* Error interrupt enable */
    STORAGE(U1STAT); break;     /* Status FIFO */
    STORAGE(U1CON); break;      /* Control */
    STORAGE(U1ADDR); break;     /* Address */
    STORAGE(U1BDTP1); break;    /* Buffer descriptor table pointer 1 */
    STORAGE(U1FRML); break;     /* Frame counter low */
    STORAGE(U1FRMH); break;     /* Frame counter high */
    STORAGE(U1TOK); break;      /* Host control */
    STORAGE(U1SOF); break;      /* SOF counter */
    STORAGE(U1BDTP2); break;    /* Buffer descriptor table pointer 2 */
    STORAGE(U1BDTP3); break;    /* Buffer descriptor table pointer 3 */
    STORAGE(U1CNFG1); break;    /* Debug and idle */
    STORAGE(U1EP(0)); break;    /* Endpoint control */
    STORAGE(U1EP(1)); break;
    STORAGE(U1EP(2)); break;
    STORAGE(U1EP(3)); break;
    STORAGE(U1EP(4)); break;
    STORAGE(U1EP(5)); break;
    STORAGE(U1EP(6)); break;
    STORAGE(U1EP(7)); break;
    STORAGE(U1EP(8)); break;
    STORAGE(U1EP(9)); break;
    STORAGE(U1EP(10)); break;
    STORAGE(U1EP(11)); break;
    STORAGE(U1EP(12)); break;
    STORAGE(U1EP(13)); break;
    STORAGE(U1EP(14)); break;
    STORAGE(U1EP(15)); break;

    /*-------------------------------------------------------------------------
     * General purpose IO signals.
     */
    STORAGE(TRISA); break;      /* Port A: mask of inputs */
    STORAGE(PORTA); break;      /* Port A: read inputs */
    STORAGE(LATA); break;       /* Port A: read outputs */
    STORAGE(ODCA); break;       /* Port A: open drain configuration */
    STORAGE(TRISB); break;      /* Port B: mask of inputs */
    STORAGE(PORTB); break;      /* Port B: read inputs */
    STORAGE(LATB); break;       /* Port B: read outputs */
    STORAGE(ODCB); break;       /* Port B: open drain configuration */
    STORAGE(TRISC); break;      /* Port C: mask of inputs */
    STORAGE(PORTC); break;      /* Port C: read inputs */
    STORAGE(LATC); break;       /* Port C: read outputs */
    STORAGE(ODCC); break;       /* Port C: open drain configuration */
    STORAGE(TRISD); break;      /* Port D: mask of inputs */
    STORAGE(PORTD); break;      /* Port D: read inputs */
    STORAGE(LATD); break;       /* Port D: read outputs */
    STORAGE(ODCD); break;       /* Port D: open drain configuration */
    STORAGE(TRISE); break;      /* Port E: mask of inputs */
    STORAGE(PORTE); break;      /* Port E: read inputs */
    STORAGE(LATE); break;       /* Port E: read outputs */
    STORAGE(ODCE); break;       /* Port E: open drain configuration */
    STORAGE(TRISF); break;      /* Port F: mask of inputs */
    STORAGE(PORTF); break;      /* Port F: read inputs */
    STORAGE(LATF); break;       /* Port F: read outputs */
    STORAGE(ODCF); break;       /* Port F: open drain configuration */
    STORAGE(TRISG); break;      /* Port G: mask of inputs */
    STORAGE(PORTG); break;      /* Port G: read inputs */
    STORAGE(LATG); break;       /* Port G: read outputs */
    STORAGE(ODCG); break;       /* Port G: open drain configuration */
    STORAGE(CNCON); break;      /* Interrupt-on-change control */
    STORAGE(CNEN); break;       /* Input change interrupt enable */
    STORAGE(CNPUE); break;      /* Input pin pull-up enable */

    /*-------------------------------------------------------------------------
     * UART 1.
     */
    STORAGE(U1RXREG);                           /* Receive data */
        *bufp = pic32_uart_get_char(s, 0);
        break;
    STORAGE(U1BRG); break;                      /* Baud rate */
    STORAGE(U1MODE); break;                     /* Mode */
    STORAGE(U1STA);                             /* Status and control */
        pic32_uart_poll_status(s, 0);
        break;
    STORAGE(U1TXREG);   *bufp = 0; break;       /* Transmit */
    STORAGE(U1MODECLR); *bufp = 0; break;
    STORAGE(U1MODESET); *bufp = 0; break;
    STORAGE(U1MODEINV); *bufp = 0; break;
    STORAGE(U1STACLR);  *bufp = 0; break;
    STORAGE(U1STASET);  *bufp = 0; break;
    STORAGE(U1STAINV);  *bufp = 0; break;
    STORAGE(U1BRGCLR);  *bufp = 0; break;
    STORAGE(U1BRGSET);  *bufp = 0; break;
    STORAGE(U1BRGINV);  *bufp = 0; break;

    /*-------------------------------------------------------------------------
     * UART 2.
     */
    STORAGE(U2RXREG);                           /* Receive data */
        *bufp = pic32_uart_get_char(s, 1);
        break;
    STORAGE(U2BRG); break;                      /* Baud rate */
    STORAGE(U2MODE); break;                     /* Mode */
    STORAGE(U2STA);                             /* Status and control */
        pic32_uart_poll_status(s, 1);
        break;
    STORAGE(U2TXREG);   *bufp = 0; break;      /* Transmit */
    STORAGE(U2MODECLR); *bufp = 0; break;
    STORAGE(U2MODESET); *bufp = 0; break;
    STORAGE(U2MODEINV); *bufp = 0; break;
    STORAGE(U2STACLR);  *bufp = 0; break;
    STORAGE(U2STASET);  *bufp = 0; break;
    STORAGE(U2STAINV);  *bufp = 0; break;
    STORAGE(U2BRGCLR);  *bufp = 0; break;
    STORAGE(U2BRGSET);  *bufp = 0; break;
    STORAGE(U2BRGINV);  *bufp = 0; break;

    /*-------------------------------------------------------------------------
     * UART 3.
     */
    STORAGE(U3RXREG);                           /* Receive data */
        *bufp = pic32_uart_get_char(s, 2);
        break;
    STORAGE(U3BRG); break;                      /* Baud rate */
    STORAGE(U3MODE); break;                     /* Mode */
    STORAGE(U3STA);                             /* Status and control */
        pic32_uart_poll_status(s, 2);
        break;
    STORAGE(U3TXREG);   *bufp = 0; break;       /* Transmit */
    STORAGE(U3MODECLR); *bufp = 0; break;
    STORAGE(U3MODESET); *bufp = 0; break;
    STORAGE(U3MODEINV); *bufp = 0; break;
    STORAGE(U3STACLR);  *bufp = 0; break;
    STORAGE(U3STASET);  *bufp = 0; break;
    STORAGE(U3STAINV);  *bufp = 0; break;
    STORAGE(U3BRGCLR);  *bufp = 0; break;
    STORAGE(U3BRGSET);  *bufp = 0; break;
    STORAGE(U3BRGINV);  *bufp = 0; break;

    /*-------------------------------------------------------------------------
     * UART 4.
     */
    STORAGE(U4RXREG);                           /* Receive data */
        *bufp = pic32_uart_get_char(s, 3);
        break;
    STORAGE(U4BRG); break;                      /* Baud rate */
    STORAGE(U4MODE); break;                     /* Mode */
    STORAGE(U4STA);                             /* Status and control */
        pic32_uart_poll_status(s, 3);
        break;
    STORAGE(U4TXREG);   *bufp = 0; break;       /* Transmit */
    STORAGE(U4MODECLR); *bufp = 0; break;
    STORAGE(U4MODESET); *bufp = 0; break;
    STORAGE(U4MODEINV); *bufp = 0; break;
    STORAGE(U4STACLR);  *bufp = 0; break;
    STORAGE(U4STASET);  *bufp = 0; break;
    STORAGE(U4STAINV);  *bufp = 0; break;
    STORAGE(U4BRGCLR);  *bufp = 0; break;
    STORAGE(U4BRGSET);  *bufp = 0; break;
    STORAGE(U4BRGINV);  *bufp = 0; break;

    /*-------------------------------------------------------------------------
     * UART 5.
     */
    STORAGE(U5RXREG);                           /* Receive data */
        *bufp = pic32_uart_get_char(s, 4);
        break;
    STORAGE(U5BRG); break;                      /* Baud rate */
    STORAGE(U5MODE); break;                     /* Mode */
    STORAGE(U5STA);                             /* Status and control */
        pic32_uart_poll_status(s, 4);
        break;
    STORAGE(U5TXREG);   *bufp = 0; break;       /* Transmit */
    STORAGE(U5MODECLR); *bufp = 0; break;
    STORAGE(U5MODESET); *bufp = 0; break;
    STORAGE(U5MODEINV); *bufp = 0; break;
    STORAGE(U5STACLR);  *bufp = 0; break;
    STORAGE(U5STASET);  *bufp = 0; break;
    STORAGE(U5STAINV);  *bufp = 0; break;
    STORAGE(U5BRGCLR);  *bufp = 0; break;
    STORAGE(U5BRGSET);  *bufp = 0; break;
    STORAGE(U5BRGINV);  *bufp = 0; break;

    /*-------------------------------------------------------------------------
     * UART 6.
     */
    STORAGE(U6RXREG);                           /* Receive data */
        *bufp = pic32_uart_get_char(s, 5);
        break;
    STORAGE(U6BRG); break;                      /* Baud rate */
    STORAGE(U6MODE); break;                     /* Mode */
    STORAGE(U6STA);                             /* Status and control */
        pic32_uart_poll_status(s, 5);
        break;
    STORAGE(U6TXREG);   *bufp = 0; break;       /* Transmit */
    STORAGE(U6MODECLR); *bufp = 0; break;
    STORAGE(U6MODESET); *bufp = 0; break;
    STORAGE(U6MODEINV); *bufp = 0; break;
    STORAGE(U6STACLR);  *bufp = 0; break;
    STORAGE(U6STASET);  *bufp = 0; break;
    STORAGE(U6STAINV);  *bufp = 0; break;
    STORAGE(U6BRGCLR);  *bufp = 0; break;
    STORAGE(U6BRGSET);  *bufp = 0; break;
    STORAGE(U6BRGINV);  *bufp = 0; break;

    /*-------------------------------------------------------------------------
     * SPI 1.
     */
    STORAGE(SPI1CON); break;                    /* Control */
    STORAGE(SPI1CONCLR); *bufp = 0; break;
    STORAGE(SPI1CONSET); *bufp = 0; break;
    STORAGE(SPI1CONINV); *bufp = 0; break;
    STORAGE(SPI1STAT); break;                   /* Status */
    STORAGE(SPI1STATCLR); *bufp = 0; break;
    STORAGE(SPI1STATSET); *bufp = 0; break;
    STORAGE(SPI1STATINV); *bufp = 0; break;
    STORAGE(SPI1BUF);                           /* Buffer */
        *bufp = pic32_spi_readbuf(s, 0);
        break;
    STORAGE(SPI1BRG); break;                    /* Baud rate */
    STORAGE(SPI1BRGCLR); *bufp = 0; break;
    STORAGE(SPI1BRGSET); *bufp = 0; break;
    STORAGE(SPI1BRGINV); *bufp = 0; break;

    /*-------------------------------------------------------------------------
     * SPI 2.
     */
    STORAGE(SPI2CON); break;                    /* Control */
    STORAGE(SPI2CONCLR); *bufp = 0; break;
    STORAGE(SPI2CONSET); *bufp = 0; break;
    STORAGE(SPI2CONINV); *bufp = 0; break;
    STORAGE(SPI2STAT); break;                   /* Status */
    STORAGE(SPI2STATCLR); *bufp = 0; break;
    STORAGE(SPI2STATSET); *bufp = 0; break;
    STORAGE(SPI2STATINV); *bufp = 0; break;
    STORAGE(SPI2BUF);                           /* Buffer */
        *bufp = pic32_spi_readbuf(s, 1);
        break;
    STORAGE(SPI2BRG); break;                    /* Baud rate */
    STORAGE(SPI2BRGCLR); *bufp = 0; break;
    STORAGE(SPI2BRGSET); *bufp = 0; break;
    STORAGE(SPI2BRGINV); *bufp = 0; break;

    /*-------------------------------------------------------------------------
     * SPI 3.
     */
    STORAGE(SPI3CON); break;                    /* Control */
    STORAGE(SPI3CONCLR); *bufp = 0; break;
    STORAGE(SPI3CONSET); *bufp = 0; break;
    STORAGE(SPI3CONINV); *bufp = 0; break;
    STORAGE(SPI3STAT); break;                   /* Status */
    STORAGE(SPI3STATCLR); *bufp = 0; break;
    STORAGE(SPI3STATSET); *bufp = 0; break;
    STORAGE(SPI3STATINV); *bufp = 0; break;
    STORAGE(SPI3BUF);                           /* SPIx Buffer */
        *bufp = pic32_spi_readbuf(s, 2);
        break;
    STORAGE(SPI3BRG); break;                    /* Baud rate */
    STORAGE(SPI3BRGCLR); *bufp = 0; break;
    STORAGE(SPI3BRGSET); *bufp = 0; break;
    STORAGE(SPI3BRGINV); *bufp = 0; break;

    /*-------------------------------------------------------------------------
     * SPI 4.
     */
    STORAGE(SPI4CON); break;                    /* Control */
    STORAGE(SPI4CONCLR); *bufp = 0; break;
    STORAGE(SPI4CONSET); *bufp = 0; break;
    STORAGE(SPI4CONINV); *bufp = 0; break;
    STORAGE(SPI4STAT); break;                   /* Status */
    STORAGE(SPI4STATCLR); *bufp = 0; break;
    STORAGE(SPI4STATSET); *bufp = 0; break;
    STORAGE(SPI4STATINV); *bufp = 0; break;
    STORAGE(SPI4BUF);                           /* Buffer */
        *bufp = pic32_spi_readbuf(s, 3);
        break;
    STORAGE(SPI4BRG); break;                    /* Baud rate */
    STORAGE(SPI4BRGCLR); *bufp = 0; break;
    STORAGE(SPI4BRGSET); *bufp = 0; break;
    STORAGE(SPI4BRGINV); *bufp = 0; break;

    default:
        printf("--- Read 1f8%05x: peripheral register not supported\n",
            offset);
        if (TRACE) {
            fprintf(qemu_logfile,
                "--- Read 1f8%05x: peripheral register not supported\n",
                offset);
        }
        exit(1);
    }
    return *bufp;
}

