sergev/qemu/hw/mips/mips_pic32mx7.c
static void io_write32(pic32_t *s, unsigned offset, unsigned data,
    const char **namep)
{
    unsigned *bufp = &VALUE(offset);

    switch (offset) {
    /*-------------------------------------------------------------------------
     * Bus matrix control registers.
     */
    WRITEOP(BMXCON); return;    /* Bus Matrix Control */
    STORAGE(BMXDKPBA); break;   /* Data RAM kernel program base address */
    STORAGE(BMXDUDBA); break;   /* Data RAM user data base address */
    STORAGE(BMXDUPBA); break;   /* Data RAM user program base address */
    STORAGE(BMXPUPBA); break;   /* Program Flash user program base address */
    READONLY(BMXDRMSZ);         /* Data RAM memory size */
    READONLY(BMXPFMSZ);         /* Program Flash memory size */
    READONLY(BMXBOOTSZ);        /* Boot Flash size */

    /*-------------------------------------------------------------------------
     * Interrupt controller registers.
     */
    WRITEOP(INTCON); return;    /* Interrupt Control */
    READONLY(INTSTAT);          /* Interrupt Status */
    WRITEOP(IPTMR);  return;    /* Temporal Proximity Timer */
    WRITEOP(IFS0); goto irq;    /* IFS(0..2) - Interrupt Flag Status */
    WRITEOP(IFS1); goto irq;
    WRITEOP(IFS2); goto irq;
    WRITEOP(IEC0); goto irq;    /* IEC(0..2) - Interrupt Enable Control */
    WRITEOP(IEC1); goto irq;
    WRITEOP(IEC2); goto irq;
    WRITEOP(IPC0); goto irq;    /* IPC(0..11) - Interrupt Priority Control */
    WRITEOP(IPC1); goto irq;
    WRITEOP(IPC2); goto irq;
    WRITEOP(IPC3); goto irq;
    WRITEOP(IPC4); goto irq;
    WRITEOP(IPC5); goto irq;
    WRITEOP(IPC6); goto irq;
    WRITEOP(IPC7); goto irq;
    WRITEOP(IPC8); goto irq;
    WRITEOP(IPC9); goto irq;
    WRITEOP(IPC10); goto irq;
    WRITEOP(IPC11); goto irq;
    WRITEOP(IPC12);
irq:    update_irq_status(s);
        return;

    /*-------------------------------------------------------------------------
     * Prefetch controller.
     */
    WRITEOP(CHECON);                        /* Prefetch Control */
        return;

    /*-------------------------------------------------------------------------
     * System controller.
     */
    WRITEOPR(OSCCON, PIC32_OSCCON_UNUSED);  /* Oscillator Control */
        break;
    WRITEOPR(OSCTUN, PIC32_OSCTUN_UNUSED);  /* Oscillator Tuning */
        break;
    STORAGE(DDPCON);                        /* Debug Data Port Control */
        break;
    READONLY(DEVID);                        /* Device Identifier */

    STORAGE(SYSKEY);                        /* System Key */
        /* Unlock state machine. */
        if (s->syskey_unlock == 0 && VALUE(SYSKEY) == 0xaa996655) {
            s->syskey_unlock = 1;
        }
        if (s->syskey_unlock == 1 && VALUE(SYSKEY) == 0x556699aa) {
            s->syskey_unlock = 2;
        } else {
            s->syskey_unlock = 0;
        }
        break;
    WRITEOPR(RCON, PIC32_RCON_UNUSED);      /* Reset Control */
        break;
    WRITEOP(RSWRST);                        /* Software Reset */
        if (s->syskey_unlock == 2 && (VALUE(RSWRST) & 1)) {
            /* Reset CPU. */
            qemu_system_reset_request();

            /* Reset all devices */
            io_reset(s);
            pic32_sdcard_reset(s);
        }
        break;

    /*-------------------------------------------------------------------------
     * DMA controller.
     */
    WRITEOP(DMACON); return;    /* DMA Control */
    STORAGE(DMASTAT); break;    /* DMA Status */
    STORAGE(DMAADDR); break;    /* DMA Address */

    /*-------------------------------------------------------------------------
     * Analog to digital converter.
     */
    WRITEOP(AD1CON1); return;   /* Control register 1 */
    WRITEOP(AD1CON2); return;   /* Control register 2 */
    WRITEOP(AD1CON3); return;   /* Control register 3 */
    WRITEOP(AD1CHS); return;    /* Channel select */
    WRITEOP(AD1CSSL); return;   /* Input scan selection */
    WRITEOP(AD1PCFG); return;   /* Port configuration */
    READONLY(ADC1BUF0);         /* Result words */
    READONLY(ADC1BUF1);
    READONLY(ADC1BUF2);
    READONLY(ADC1BUF3);
    READONLY(ADC1BUF4);
    READONLY(ADC1BUF5);
    READONLY(ADC1BUF6);
    READONLY(ADC1BUF7);
    READONLY(ADC1BUF8);
    READONLY(ADC1BUF9);
    READONLY(ADC1BUFA);
    READONLY(ADC1BUFB);
    READONLY(ADC1BUFC);
    READONLY(ADC1BUFD);
    READONLY(ADC1BUFE);
    READONLY(ADC1BUFF);

    /*--------------------------------------
     * USB registers.
     */
    STORAGE(U1OTGIR);           /* OTG interrupt flags */
        VALUE(U1OTGIR) = 0;
        return;
    STORAGE(U1OTGIE); break;    /* OTG interrupt enable */
    READONLY(U1OTGSTAT);        /* Comparator and pin status */
    STORAGE(U1OTGCON); break;   /* Resistor and pin control */
    STORAGE(U1PWRC); break;     /* Power control */
    STORAGE(U1IR);              /* Pending interrupt */
        VALUE(U1IR) = 0;
        return;
    STORAGE(U1IE); break;       /* Interrupt enable */
    STORAGE(U1EIR);             /* Pending error interrupt */
        VALUE(U1EIR) = 0;
        return;
    STORAGE(U1EIE); break;      /* Error interrupt enable */
    READONLY(U1STAT);           /* Status FIFO */
    STORAGE(U1CON); break;      /* Control */
    STORAGE(U1ADDR); break;     /* Address */
    STORAGE(U1BDTP1); break;    /* Buffer descriptor table pointer 1 */
    READONLY(U1FRML);           /* Frame counter low */
    READONLY(U1FRMH);           /* Frame counter high */
    STORAGE(U1TOK); break;      /* Host control */
    STORAGE(U1SOF); break;      /* SOF counter */
    STORAGE(U1BDTP2); break;    /* Buffer descriptor table pointer 2 */
    STORAGE(U1BDTP3); break;    /* Buffer descriptor table pointer 3 */
    STORAGE(U1CNFG1); break;    /* Debug and idle */
    STORAGE(U1EP(0)); break;    /* Endpoint control */
    STORAGE(U1EP(1)); break;
    STORAGE(U1EP(2)); break;
    STORAGE(U1EP(3)); break;
    STORAGE(U1EP(4)); break;
    STORAGE(U1EP(5)); break;
    STORAGE(U1EP(6)); break;
    STORAGE(U1EP(7)); break;
    STORAGE(U1EP(8)); break;
    STORAGE(U1EP(9)); break;
    STORAGE(U1EP(10)); break;
    STORAGE(U1EP(11)); break;
    STORAGE(U1EP(12)); break;
    STORAGE(U1EP(13)); break;
    STORAGE(U1EP(14)); break;
    STORAGE(U1EP(15)); break;

    /*-------------------------------------------------------------------------
     * General purpose IO signals.
     */
    WRITEOP(TRISA); return;         /* Port A: mask of inputs */
    WRITEOPX(PORTA, LATA);          /* Port A: write outputs */
    WRITEOP(LATA);                  /* Port A: write outputs */
        pic32_gpio_write(s, 0, VALUE(LATA));
        return;
    WRITEOP(ODCA); return;          /* Port A: open drain configuration */
    WRITEOP(TRISB); return;         /* Port B: mask of inputs */
    WRITEOPX(PORTB, LATB);          /* Port B: write outputs */
    WRITEOP(LATB);                  /* Port B: write outputs */
        pic32_gpio_write(s, 1, VALUE(LATB));
        return;
    WRITEOP(ODCB); return;          /* Port B: open drain configuration */
    WRITEOP(TRISC); return;         /* Port C: mask of inputs */
    WRITEOPX(PORTC, LATC);          /* Port C: write outputs */
    WRITEOP(LATC);                  /* Port C: write outputs */
        pic32_gpio_write(s, 2, VALUE(LATC));
        return;
    WRITEOP(ODCC); return;          /* Port C: open drain configuration */
    WRITEOP(TRISD); return;         /* Port D: mask of inputs */
    WRITEOPX(PORTD, LATD);          /* Port D: write outputs */
    WRITEOP(LATD);                  /* Port D: write outputs */
        pic32_gpio_write(s, 3, VALUE(LATD));
        return;
    WRITEOP(ODCD); return;          /* Port D: open drain configuration */
    WRITEOP(TRISE); return;         /* Port E: mask of inputs */
    WRITEOPX(PORTE, LATE);          /* Port E: write outputs */
    WRITEOP(LATE);                  /* Port E: write outputs */
        pic32_gpio_write(s, 4, VALUE(LATE));
        return;
    WRITEOP(ODCE); return;          /* Port E: open drain configuration */
    WRITEOP(TRISF); return;         /* Port F: mask of inputs */
    WRITEOPX(PORTF, LATF);          /* Port F: write outputs */
    WRITEOP(LATF);                  /* Port F: write outputs */
        pic32_gpio_write(s, 5, VALUE(LATF));
        return;
    WRITEOP(ODCF); return;          /* Port F: open drain configuration */
    WRITEOP(TRISG); return;         /* Port G: mask of inputs */
    WRITEOPX(PORTG, LATG);          /* Port G: write outputs */
    WRITEOP(LATG);                  /* Port G: write outputs */
        pic32_gpio_write(s, 6, VALUE(LATG));
        return;
    WRITEOP(ODCG); return;          /* Port G: open drain configuration */
    WRITEOP(CNCON); return;         /* Interrupt-on-change control */
    WRITEOP(CNEN); return;          /* Input change interrupt enable */
    WRITEOP(CNPUE); return;         /* Input pin pull-up enable */

    /*-------------------------------------------------------------------------
     * UART 1.
     */
    STORAGE(U1TXREG);                               /* Transmit */
        pic32_uart_put_char(s, 0, data);
        break;
    WRITEOP(U1MODE);                                /* Mode */
        pic32_uart_update_mode(s, 0);
        return;
    WRITEOPR(U1STA,                                 /* Status and control */
        PIC32_USTA_URXDA | PIC32_USTA_FERR | PIC32_USTA_PERR |
        PIC32_USTA_RIDLE | PIC32_USTA_TRMT | PIC32_USTA_UTXBF);
        pic32_uart_update_status(s, 0);
        return;
    WRITEOP(U1BRG); return;                         /* Baud rate */
    READONLY(U1RXREG);                              /* Receive */

    /*-------------------------------------------------------------------------
     * UART 2.
     */
    STORAGE(U2TXREG);                               /* Transmit */
        pic32_uart_put_char(s, 1, data);
        break;
    WRITEOP(U2MODE);                                /* Mode */
        pic32_uart_update_mode(s, 1);
        return;
    WRITEOPR(U2STA,                                 /* Status and control */
        PIC32_USTA_URXDA | PIC32_USTA_FERR | PIC32_USTA_PERR |
        PIC32_USTA_RIDLE | PIC32_USTA_TRMT | PIC32_USTA_UTXBF);
        pic32_uart_update_status(s, 1);
        return;
    WRITEOP(U2BRG); return;                         /* Baud rate */
    READONLY(U2RXREG);                              /* Receive */

    /*-------------------------------------------------------------------------
     * UART 3.
     */
    STORAGE(U3TXREG);                               /* Transmit */
        pic32_uart_put_char(s, 2, data);
        break;
    WRITEOP(U3MODE);                                /* Mode */
        pic32_uart_update_mode(s, 2);
        return;
    WRITEOPR(U3STA,                                 /* Status and control */
        PIC32_USTA_URXDA | PIC32_USTA_FERR | PIC32_USTA_PERR |
        PIC32_USTA_RIDLE | PIC32_USTA_TRMT | PIC32_USTA_UTXBF);
        pic32_uart_update_status(s, 2);
        return;
    WRITEOP(U3BRG); return;                         /* Baud rate */
    READONLY(U3RXREG);                              /* Receive */

    /*-------------------------------------------------------------------------
     * UART 4.
     */
    STORAGE(U4TXREG);                               /* Transmit */
        pic32_uart_put_char(s, 3, data);
        break;
    WRITEOP(U4MODE);                                /* Mode */
        pic32_uart_update_mode(s, 3);
        return;
    WRITEOPR(U4STA,                                 /* Status and control */
        PIC32_USTA_URXDA | PIC32_USTA_FERR | PIC32_USTA_PERR |
        PIC32_USTA_RIDLE | PIC32_USTA_TRMT | PIC32_USTA_UTXBF);
        pic32_uart_update_status(s, 3);
        return;
    WRITEOP(U4BRG); return;                         /* Baud rate */
    READONLY(U4RXREG);                              /* Receive */

    /*-------------------------------------------------------------------------
     * UART 5.
     */
    STORAGE(U5TXREG);                               /* Transmit */
        pic32_uart_put_char(s, 4, data);
        break;
    WRITEOP(U5MODE);                                /* Mode */
        pic32_uart_update_mode(s, 4);
        return;
    WRITEOPR(U5STA,                                 /* Status and control */
        PIC32_USTA_URXDA | PIC32_USTA_FERR | PIC32_USTA_PERR |
        PIC32_USTA_RIDLE | PIC32_USTA_TRMT | PIC32_USTA_UTXBF);
        pic32_uart_update_status(s, 4);
        return;
    WRITEOP(U5BRG); return;                         /* Baud rate */
    READONLY(U5RXREG);                              /* Receive */

    /*-------------------------------------------------------------------------
     * UART 6.
     */
    STORAGE(U6TXREG);                               /* Transmit */
        pic32_uart_put_char(s, 5, data);
        break;
    WRITEOP(U6MODE);                                /* Mode */
        pic32_uart_update_mode(s, 5);
        return;
    WRITEOPR(U6STA,                                 /* Status and control */
        PIC32_USTA_URXDA | PIC32_USTA_FERR | PIC32_USTA_PERR |
        PIC32_USTA_RIDLE | PIC32_USTA_TRMT | PIC32_USTA_UTXBF);
        pic32_uart_update_status(s, 5);
        return;
    WRITEOP(U6BRG); return;                         /* Baud rate */
    READONLY(U6RXREG);                              /* Receive */

    /*-------------------------------------------------------------------------
     * SPI.
     */
    WRITEOP(SPI1CON);                               /* Control */
        pic32_spi_control(s, 0);
        return;
    WRITEOPR(SPI1STAT, ~PIC32_SPISTAT_SPIROV);      /* Status */
        return;                                     /* Only ROV bit writable */
    STORAGE(SPI1BUF);                               /* Buffer */
        pic32_spi_writebuf(s, 0, data);
        return;
    WRITEOP(SPI1BRG); return;                       /* Baud rate */
    WRITEOP(SPI2CON);                               /* Control */
        pic32_spi_control(s, 1);
        return;
    WRITEOPR(SPI2STAT, ~PIC32_SPISTAT_SPIROV);      /* Status */
        return;                                     /* Only ROV bit writable */
    STORAGE(SPI2BUF);                               /* Buffer */
        pic32_spi_writebuf(s, 1, data);
        return;
    WRITEOP(SPI2BRG); return;                       /* Baud rate */
    WRITEOP(SPI3CON);                               /* Control */
        pic32_spi_control(s, 2);
        return;
    WRITEOPR(SPI3STAT, ~PIC32_SPISTAT_SPIROV);      /* Status */
        return;                                     /* Only ROV bit writable */
    STORAGE(SPI3BUF);                               /* Buffer */
        pic32_spi_writebuf(s, 2, data);
        return;
    WRITEOP(SPI3BRG); return;                       /* Baud rate */
    WRITEOP(SPI4CON);                               /* Control */
        pic32_spi_control(s, 3);
        return;
    WRITEOPR(SPI4STAT, ~PIC32_SPISTAT_SPIROV);      /* Status */
        return;                                     /* Only ROV bit writable */
    STORAGE(SPI4BUF);                               /* Buffer */
        pic32_spi_writebuf(s, 3, data);
        return;
    WRITEOP(SPI4BRG); return;                       /* Baud rate */

    default:
        printf("--- Write %08x to 1f8%05x: peripheral register not supported\n",
            data, offset);
        if (TRACE) {
            fprintf(qemu_logfile,
            "--- Write %08x to 1f8%05x: peripheral register not supported\n",
                data, offset);
        }
        exit(1);
readonly:
        printf("--- Write %08x to %s: readonly register\n",
            data, *namep);
        if (TRACE) {
            fprintf(qemu_logfile, "--- Write %08x to %s: readonly register\n",
                data, *namep);
        }
        *namep = 0;
        return;
    }
    *bufp = data;
}

