sergev/qemu/hw/mips/mips_pic32mx7.c
static uint64_t pic32_io_read(void *opaque, hwaddr addr, unsigned bytes)
{
    pic32_t *s = opaque;
    uint32_t offset = addr & 0xfffff;
    const char *name = "???";
    uint32_t data = 0;

    data = io_read32(s, offset & ~3, &name);
    switch (bytes) {
    case 1:
        offset &= 3;
        if (offset != 0) {
            /* Unaligned read. */
            data >>= offset * 8;
        }
        data = (uint8_t) data;
        if (TRACE) {
            fprintf(qemu_logfile, "--- I/O Read  %02x from %s\n", data, name);
        }
        break;
    case 2:
        if (offset & 2) {
            /* Unaligned read. */
            data >>= 16;
        }
        data = (uint16_t) data;
        if (TRACE) {
            fprintf(qemu_logfile, "--- I/O Read  %04x from %s\n", data, name);
        }
        break;
    default:
        if (TRACE) {
            fprintf(qemu_logfile, "--- I/O Read  %08x from %s\n", data, name);
        }
        break;
    }
    return data;
}

static void pic32_io_write(void *opaque, hwaddr addr, uint64_t data,
    unsigned bytes)
{
    pic32_t *s = opaque;
    uint32_t offset = addr & 0xfffff;
    const char *name = "???";

    /* Fetch data and align to word format. */
    switch (bytes) {
    case 1:
        data = (uint8_t) data;
        data <<= (offset & 3) * 8;
        break;
    case 2:
        data = (uint16_t) data;
        data <<= (offset & 2) * 8;
        break;
    }
    io_write32(s, offset & ~3, data, &name);

    if (TRACE && name != 0) {
        fprintf(qemu_logfile, "--- I/O Write %08x to %s\n",
            (uint32_t) data, name);
    }
}

/*
 * This function is called when the processor is stopped
 * on WAIT instruction, waiting for external interrupt.
 */
static void pic32_exec_exit(CPUState *cs)
{
    MIPSCPU *cpu = MIPS_CPU(cs);
    CPUMIPSState *env = &cpu->env;

    if (cs->halted && !(env->CP0_Status & (1 << CP0St_IE))) {
        /* WAIT instruction with interrupts disabled - halt the simulation. */
        qemu_system_shutdown_request();
    }
}

static const MemoryRegionOps pic32_io_ops = {
    .read       = pic32_io_read,
    .write      = pic32_io_write,
    .endianness = DEVICE_NATIVE_ENDIAN,
};

static void main_cpu_reset(void *opaque)
{
    MIPSCPU *cpu = opaque;
    CPUMIPSState *env = &cpu->env;
    int i;

    cpu_reset(CPU(cpu));

    /* Adjust the initial configuration for M4K core. */
    env->CP0_IntCtl = 0;
    env->CP0_Debug = (1 << CP0DB_CNT) | (3 << CP0DB_VER);
    for (i = 0; i < 7; i++) {
        env->CP0_WatchHi[i] = 0;
    }
}

static void store_byte(unsigned address, unsigned char byte)
{
    if (address >= PROGRAM_FLASH_START &&
        address < PROGRAM_FLASH_START + PROGRAM_FLASH_SIZE) {
        /*printf("Store %02x to program memory %08x\n", byte, address);*/
        prog_ptr[address & 0xfffff] = byte;
        return;
    }

    if (address >= BOOT_FLASH_START &&
        address < BOOT_FLASH_START + BOOT_FLASH_SIZE) {
        /*printf("Store %02x to boot memory %08x\n", byte, address);*/
        boot_ptr[address & 0xffff] = byte;
        return;
    }

    printf("Bad hex file: "
        "incorrect address %08X, must be %08X-%08X or %08X-%08X\n",
        address, PROGRAM_FLASH_START,
        PROGRAM_FLASH_START + PROGRAM_FLASH_SIZE - 1,
        BOOT_FLASH_START, BOOT_FLASH_START + BOOT_FLASH_SIZE - 1);
    exit(1);
}

/*
 * Ignore ^C and ^\ signals and pass these characters to the target.
 */
static void pic32_pass_signal_chars(void)
{
    struct termios tty;

    tcgetattr(0, &tty);
    tty.c_lflag &= ~ISIG;
    tcsetattr(0, TCSANOW, &tty);
}

static void pic32_init(MachineState *machine, int board_type)
{
    const char *cpu_model = machine->cpu_model;
    unsigned ram_size = DATA_MEM_SIZE;
    MemoryRegion *system_memory = get_system_memory();
    MemoryRegion *ram_main = g_new(MemoryRegion, 1);
    MemoryRegion *prog_mem = g_new(MemoryRegion, 1);
    MemoryRegion *boot_mem = g_new(MemoryRegion, 1);
    MemoryRegion *io_mem = g_new(MemoryRegion, 1);
    MIPSCPU *cpu;
    CPUMIPSState *env;

    DeviceState *dev = qdev_create(NULL, TYPE_MIPS_PIC32);
    pic32_t *s = OBJECT_CHECK(pic32_t, dev, TYPE_MIPS_PIC32);
    s->board_type = board_type;
    s->stop_on_reset = 1;               /* halt simulation on soft reset */
    s->iomem = g_malloc0(IO_MEM_SIZE);  /* backing storage for I/O area */

    qdev_init_nofail(dev);

    /* Init CPU. */
    if (!cpu_model) {
        cpu_model = "M4K";
    }
    printf("Board: %s\n", board_name[board_type]);
    if (qemu_logfile) {
        fprintf(qemu_logfile, "Board: %s\n", board_name[board_type]);
    }

    printf("Processor: %s\n", cpu_model);
    if (qemu_logfile) {
        fprintf(qemu_logfile, "Processor: %s\n", cpu_model);
    }

    cpu = cpu_mips_init(cpu_model);
    if (!cpu) {
        fprintf(stderr, "Unable to find CPU definition\n");
        exit(1);
    }
    s->cpu = cpu;
    env = &cpu->env;

    /* Register RAM */
    printf("RAM size: %u kbytes\n", ram_size / 1024);
    if (qemu_logfile) {
        fprintf(qemu_logfile, "RAM size: %u kbytes\n", ram_size / 1024);
    }

    memory_region_init_ram(ram_main, NULL, "kernel.ram",
        ram_size, &error_abort);
    vmstate_register_ram_global(ram_main);
    memory_region_add_subregion(system_memory, DATA_MEM_START, ram_main);

    /* Alias for user space 96 kbytes.
     * For MX family only. */
    MemoryRegion *ram_user = g_new(MemoryRegion, 1);
    memory_region_init_alias(ram_user, NULL, "user.ram",
        ram_main, 0x8000, ram_size - 0x8000);
    memory_region_add_subregion(system_memory,
        USER_MEM_START + 0x8000, ram_user);

    /* Special function registers. */
    memory_region_init_io(io_mem, NULL, &pic32_io_ops, s,
                          "io", IO_MEM_SIZE);
    memory_region_add_subregion(system_memory, IO_MEM_START, io_mem);

    /*
     * Map the flash memory.
     */
    memory_region_init_ram(boot_mem, NULL, "boot.flash",
        BOOT_FLASH_SIZE, &error_abort);
    memory_region_init_ram(prog_mem, NULL, "prog.flash",
        PROGRAM_FLASH_SIZE, &error_abort);

