sergev/qemu/hw/mips/mips_pic32mx7.c
    /* Load a Flash memory image. */
    if (!machine->kernel_filename) {
        error_report("No -kernel argument was specified.");
        exit(1);
    }
    prog_ptr = memory_region_get_ram_ptr(prog_mem);
    boot_ptr = memory_region_get_ram_ptr(boot_mem);
    if (bios_name) {
        pic32_load_hex_file(bios_name, store_byte);
    }
    pic32_load_hex_file(machine->kernel_filename, store_byte);

    memory_region_set_readonly(boot_mem, true);
    memory_region_set_readonly(prog_mem, true);
    memory_region_add_subregion(system_memory, BOOT_FLASH_START, boot_mem);
    memory_region_add_subregion(system_memory, PROGRAM_FLASH_START, prog_mem);

    /* Init internal devices */
    s->irq_raise = irq_raise;
    s->irq_clear = irq_clear;
    qemu_register_reset(main_cpu_reset, cpu);

    /* Setup interrupt controller in EIC mode. */
    qemu_irq *qi = qemu_allocate_irqs(pic32_irq_request, s, 3);
    env->eic_timer_irq = qi[0];
    env->eic_soft_irq[0] = qi[1];
    env->eic_soft_irq[1] = qi[2];
    env->CP0_Config3 |= 1 << CP0C3_VEIC;

    /* CPU runs at 80MHz.
     * Count register increases at half this rate. */
    cpu_mips_clock_init(env, 40*1000*1000);

    /* Setup callback for CPU halt. */
    MIPSCPUClass *mcc = MIPS_CPU_GET_CLASS(cpu);
    CPUClass *cc = CPU_CLASS(mcc);
    cc->cpu_exec_exit = pic32_exec_exit;

    /*
     * Initialize board-specific parameters.
     */
    int cs0_port, cs0_pin, cs1_port, cs1_pin;
    switch (board_type) {
    default:
    case BOARD_MAX32:
        BOOTMEM(DEVCFG0) = 0xffffff7f;      /* Max32 board */
        BOOTMEM(DEVCFG1) = 0x5bfd6aff;      /* console on UART1 */
        BOOTMEM(DEVCFG2) = 0xd979f8f9;
        BOOTMEM(DEVCFG3) = 0xffff0722;
        VALUE(DEVID)     = 0x04307053;      /* MX795F512L */
        VALUE(OSCCON)    = 0x01453320;      /* external oscillator 8MHz */
        s->sdcard_spi_port = 1;             /* SD card at SPI2, */
        cs0_port = 2;  cs0_pin = 14;        /* select0 at C14, */
        cs1_port = 3;  cs1_pin = 1;         /* select1 at D1 */
        break;
    case BOARD_MAXIMITE:
        /* TODO: get real data from Maximite board */
        BOOTMEM(DEVCFG0) = 0xffffff7f;
        BOOTMEM(DEVCFG1) = 0x5bfd6aff;      /* console on UART1 */
        BOOTMEM(DEVCFG2) = 0xd979f8f9;
        BOOTMEM(DEVCFG3) = 0xffff0722;
        VALUE(DEVID)     = 0x04307053;      /* MX795F512L */
        VALUE(OSCCON)    = 0x01453320;      /* external oscillator 8MHz */
        s->sdcard_spi_port = 3;             /* SD card at SPI4, */
        cs0_port = 4;  cs0_pin = 0;         /* select0 at E0, */
        cs1_port = -1; cs1_pin = -1;        /* select1 not available */
        break;
    case BOARD_EXPLORER16:
        /* TODO: get real data from Explorer16 board */
        BOOTMEM(DEVCFG0) = 0xffffff7f;
        BOOTMEM(DEVCFG1) = 0x5bfd6aff;      /* console on UART2 */
        BOOTMEM(DEVCFG2) = 0xd979f8f9;
        BOOTMEM(DEVCFG3) = 0xffff0722;
        VALUE(DEVID)     = 0x04307053;      /* MX795F512L */
        VALUE(OSCCON)    = 0x01453320;      /* external oscillator 8MHz */
        s->sdcard_spi_port = 0;             /* SD card at SPI1, */
        cs0_port = 1;  cs0_pin = 1;         /* select0 at B1, */
        cs1_port = 1;  cs1_pin = 2;         /* select1 at B2 */
        break;
    }

    /* UARTs */
    pic32_uart_init(s, 0, PIC32_IRQ_U1E, U1STA, U1MODE);
    pic32_uart_init(s, 1, PIC32_IRQ_U2E, U2STA, U2MODE);
    pic32_uart_init(s, 2, PIC32_IRQ_U3E, U3STA, U3MODE);
    pic32_uart_init(s, 3, PIC32_IRQ_U4E, U4STA, U4MODE);
    pic32_uart_init(s, 4, PIC32_IRQ_U5E, U5STA, U5MODE);
    pic32_uart_init(s, 5, PIC32_IRQ_U6E, U6STA, U6MODE);

    /* SPIs */
    pic32_spi_init(s, 0, PIC32_IRQ_SPI1E, SPI1CON, SPI1STAT);
    pic32_spi_init(s, 1, PIC32_IRQ_SPI2E, SPI2CON, SPI2STAT);
    pic32_spi_init(s, 2, PIC32_IRQ_SPI3E, SPI3CON, SPI3STAT);
    pic32_spi_init(s, 3, PIC32_IRQ_SPI4E, SPI4CON, SPI4STAT);

    /*
     * Load SD card images.
     * Use options:
     *      -sd filename
     * or   -hda filename
     * and  -hdb filename
     */
    const char *sd0_file = 0, *sd1_file = 0;
    DriveInfo *dinfo = drive_get(IF_IDE, 0, 0);
    if (dinfo) {
        sd0_file = qemu_opt_get(dinfo->opts, "file");
        dinfo->is_default = 1;

        dinfo = drive_get(IF_IDE, 0, 1);
        if (dinfo) {
            sd1_file = qemu_opt_get(dinfo->opts, "file");
            dinfo->is_default = 1;
        }
    }
    if (!sd0_file) {
        dinfo = drive_get(IF_SD, 0, 0);
        if (dinfo) {
            sd0_file = qemu_opt_get(dinfo->opts, "file");
            dinfo->is_default = 1;
        }
    }
    pic32_sdcard_init(s, 0, "sd0", sd0_file, cs0_port, cs0_pin);
    pic32_sdcard_init(s, 1, "sd1", sd1_file, cs1_port, cs1_pin);

    io_reset(s);
    pic32_sdcard_reset(s);
    pic32_pass_signal_chars();
}

static void pic32_init_max32(MachineState *machine)
{
    pic32_init(machine, BOARD_MAX32);
}

static void pic32_init_maximite(MachineState *machine)
{
    pic32_init(machine, BOARD_MAXIMITE);
}

static void pic32_init_explorer16(MachineState *machine)
{
    pic32_init(machine, BOARD_EXPLORER16);
}

static int pic32_sysbus_device_init(SysBusDevice *sysbusdev)
{
    return 0;
}

static void pic32_class_init(ObjectClass *klass, void *data)
{
    SysBusDeviceClass *k = SYS_BUS_DEVICE_CLASS(klass);

    k->init = pic32_sysbus_device_init;
}

static const TypeInfo pic32_device = {
    .name          = TYPE_MIPS_PIC32,
    .parent        = TYPE_SYS_BUS_DEVICE,
    .instance_size = sizeof(pic32_t),
    .class_init    = pic32_class_init,
};

static void pic32_register_types(void)
{
    type_register_static(&pic32_device);
}

static QEMUMachine pic32_board[3] = {
    {
        .name       = "pic32mx7-max32",
        .desc       = "PIC32MX7 microcontroller on chipKIT Max32 board",
        .init       = pic32_init_max32,
        .max_cpus   = 1,
    },
    {
        .name       = "pic32mx7-maximite",
        .desc       = "PIC32MX7 microcontroller on Geoff's Maximite board",
        .init       = pic32_init_maximite,
        .max_cpus   = 1,
    },
    {
        .name       = "pic32mx7-explorer16",
        .desc       = "PIC32MX7 microcontroller on Microchip Explorer-16 board",
        .init       = pic32_init_explorer16,
        .max_cpus   = 1,
    },
};

static void pic32_machine_init(void)
{
    qemu_register_machine(&pic32_board[0]);
    qemu_register_machine(&pic32_board[1]);
    qemu_register_machine(&pic32_board[2]);
}

type_init(pic32_register_types)
machine_init(pic32_machine_init);
